Documents/ВопросыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВопросыПользователей</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВопросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Снят</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВНовостях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязателенДляОзнакомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧСсылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВопросыПользователей/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ
////////////////////////////////////////////////////////////////////////////////

Перем Админ Экспорт;




////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

Процедура ПоказатьПрикрепленныйФайл(ИмяФайла) Экспорт
	НайдСтрока = ТЧФайлы.Найти(ИмяФайла, "ИмяФайла");
	Если НайдСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДвоичныеДанные = НайдСтрока.Файл.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Сообщить("Внешний файл отсутствует в базе!");
		Возврат;
	КонецЕсли; 
	времФайл = КаталогВременныхФайлов() + НайдСтрока.ИмяФайла;
	ДвоичныеДанные.Записать(времФайл);
	ЗапуститьПриложение(времФайл);
	//УдалитьФайлы(времФайл);
КонецПроцедуры // ПоказатьПрикрепленныйФайл()

Функция СвойВопрос() Экспорт
	Возврат Автор = ПараметрыСеанса.ТекущийПользователь;
КонецФункции // СвойВопрос()

Функция ФорматироватьСтрокуДляHTML(стр) Экспорт
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.MultiLine    = Истина;
	RegExp.Global 		= Истина;
	RegExp.IgnoreCase   = Истина;
	RegExp.Pattern = Символы.ПС;
	Возврат СокрЛП(RegExp.Replace(стр, "<br>"));
КонецФункции // ФорматироватьСтрокуДляHTML()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.MultiLine    = Истина;
	RegExp.Global 		= Истина;
	RegExp.IgnoreCase   = Истина;
	RegExp.Pattern 		= "'";
	Вопрос = СокрЛП(RegExp.Replace(Вопрос, ""));
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ОСНОВНАЯ ЧАСТЬ
////////////////////////////////////////////////////////////////////////////////

Админ = МодульФорум.ПолныеПраваНаФоруме();
